# โปรแกรมจำลองการนับถอยหลังสู่วันฝึกงาน
print("เริ่มนับถอยหลังสู่การเตรียมตัวฝึกงาน")
# for i in range(1, 6):: หมายความว่า ให้สร้างตัวแปรตัวนับชื่อ i โดยเริ่มวิ่งจากเลข 1 ไปจนถึงก่อนเลข 6 (แปลว่ามันจะวนรอบที่ 1, 2, 3, 4 และ 5 รวมทั้งหมด 5 รอบครับ
for time in range (1, 6):
#การเยื้องหน้าโค้ด (Indentation): คำสั่ง print ที่อยู่ใต้ for จะต้องเคาะเว้นวรรค (Tab) เข้ามาข้างในเช่นเดียวกับ if เพื่อบอกว่าคำสั่งนี้จะถูกทำซ้ำในทุกๆ รอบของการวนลูป
    print("วันที่", time,"ลุยอ่านโค้ดและทำโปรเจ็ค")
#ผลลัพธ์ที่จะออกมา: คอมพิวเตอร์จะพิมพ์ข้อความวนซ้ำ 5 รอบ โดยเปลี่ยนเลข i ตามรอบที่มันวิ่งไปเรื่อยๆ ครับ
print("สู้ๆเตรียมตัวครบ 1 ปีพร้อมลุยสนามจริง")