# โปรแกรมจำลองการเก็บชั่วโมงฝึกเขียนโค้ด
# สร้างตัวแปรเริ่มต้นที่ 0 ชั่วโมง
hours = 0
# while hours < 5:: แปลว่า "ตราบใดที่" ตัวแปร hours ยังน้อยกว่า 5 ให้ทำคำสั่งข้างในวนไปเรื่อยๆ
while hours < 5:
    print("ตอนนี้สะสมเวลาเขียนโค้ดได้:", hours, "ชั่วโมง")
# hours = hours + 1: สำคัญมากๆ ครับ! ถ้าเราไม่เพิ่มค่า hours ขึ้นทีละ 1 ในแต่ละรอบ คอมพิวเตอร์จะติดอยู่ในลูปไม่ยอมจบไม่ยอมสิ้น (เรียกว่า Infinite Loop) การบวกเพิ่มนี้ทำให้มันขยับเข้าใกล้จุดสิ้นสุดทีละนิด
# เมื่อ hours วิ่งจนถึง 5 (5 น้อยกว่า 5 เป็นเท็จ) ลูปจะหลุดออกมา แล้วมาทำคำสั่งสุดท้าย print("เย้! ครบ 5 ชั่วโมงแล้ว...")
    hours = hours + 1 #เพิ่มค่าชั่วโมงทีละ 1 ในทุกๆรอบ
print("เย้! ครบ 5 ชั่วโมงแล้ว พักผ่อนได้!")